---
title: CombinableElementArray
classe: Autodesk.Revit.DB.CombinableElementArray
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# CombinableElementArray

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `combinableElementArray.IsEmpty` | Boolean |
| `CombinableElement Item { get; set; }` | `combinableElementArray.Item` | CombinableElement |
| `Int32 Size { get; }` | `combinableElementArray.Size` | Int32 |
| `Void Append(CombinableElement)` | `combinableElementArray.Append(item)` | Void |
| `Void Clear()` | `combinableElementArray.Clear()` | Void |
| `CombinableElementArrayIterator ForwardIterator()` | `combinableElementArray.ForwardIterator()` | CombinableElementArrayIterator |
| `IEnumerator GetEnumerator()` | `combinableElementArray.GetEnumerator()` | IEnumerator |
| `Void Insert(CombinableElement, Int32)` | `combinableElementArray.Insert(item, index)` | Void |
| `CombinableElementArrayIterator ReverseIterator()` | `combinableElementArray.ReverseIterator()` | CombinableElementArrayIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```